lkolbly/cmsis-svd/data/TexasInstruments/LM3S5P31.svd
        <register>
          <name>TXCSRL8</name>
          <description>USB Transmit Control and Status Endpoint 8 Low</description>
          <addressOffset>0x00000182</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL8_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL8_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL8_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL8_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL8_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL8</name>
          <description>USB Transmit Control and Status Endpoint 8 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000182</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL8_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL8_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH8</name>
          <description>USB Transmit Control and Status Endpoint 8 High</description>
          <addressOffset>0x00000183</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH8_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH8_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH8_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH8_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH8_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH8_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP8</name>
          <description>USB Maximum Receive Data Endpoint 8</description>
          <addressOffset>0x00000184</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP8_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL8</name>
          <description>USB Receive Control and Status Endpoint 8 Low</description>
          <addressOffset>0x00000186</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL8_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL8_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH8</name>
          <description>USB Receive Control and Status Endpoint 8 High</description>
          <addressOffset>0x00000187</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH8_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH8_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH8_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH8_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH8</name>
          <description>USB Receive Control and Status Endpoint 8 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000187</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH8_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH8_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT8</name>
          <description>USB Receive Byte Count Endpoint 8</description>
          <addressOffset>0x00000188</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT8_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP9</name>
          <description>USB Maximum Transmit Data Endpoint 9</description>
          <addressOffset>0x00000190</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP9_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL9</name>
          <description>USB Transmit Control and Status Endpoint 9 Low</description>
          <addressOffset>0x00000192</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL9_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL9_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL9_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL9_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL9_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL9</name>
          <description>USB Transmit Control and Status Endpoint 9 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000192</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL9_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL9_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH9</name>
          <description>USB Transmit Control and Status Endpoint 9 High</description>
          <addressOffset>0x00000193</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH9_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH9_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH9_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH9_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH9_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH9_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP9</name>
          <description>USB Maximum Receive Data Endpoint 9</description>
          <addressOffset>0x00000194</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP9_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL9</name>
          <description>USB Receive Control and Status Endpoint 9 Low</description>
          <addressOffset>0x00000196</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL9_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL9_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH9</name>
          <description>USB Receive Control and Status Endpoint 9 High</description>
          <addressOffset>0x00000197</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH9_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH9_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH9_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH9_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH9</name>
          <description>USB Receive Control and Status Endpoint 9 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000197</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH9_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH9_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT9</name>
          <description>USB Receive Byte Count Endpoint 9</description>
          <addressOffset>0x00000198</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT9_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP10</name>
          <description>USB Maximum Transmit Data Endpoint 10</description>
          <addressOffset>0x000001A0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP10_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL10</name>
          <description>USB Transmit Control and Status Endpoint 10 Low</description>
          <addressOffset>0x000001A2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL10_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL10_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL10_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL10_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL10_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL10</name>
          <description>USB Transmit Control and Status Endpoint 10 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001A2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL10_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL10_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH10</name>
          <description>USB Transmit Control and Status Endpoint 10 High</description>
          <addressOffset>0x000001A3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH10_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH10_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH10_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH10_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH10_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH10_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP10</name>
          <description>USB Maximum Receive Data Endpoint 10</description>
          <addressOffset>0x000001A4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP10_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL10</name>
          <description>USB Receive Control and Status Endpoint 10 Low</description>
          <addressOffset>0x000001A6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL10_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL10_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH10</name>
          <description>USB Receive Control and Status Endpoint 10 High</description>
          <addressOffset>0x000001A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH10_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH10_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH10_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH10_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH10</name>
          <description>USB Receive Control and Status Endpoint 10 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001A7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH10_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH10_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT10</name>
          <description>USB Receive Byte Count Endpoint 10</description>
          <addressOffset>0x000001A8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT10_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
