lkolbly/cmsis-svd/data/TexasInstruments/LM3S5P31.svd
        <register>
          <name>RXCOUNT13</name>
          <description>USB Receive Byte Count Endpoint 13</description>
          <addressOffset>0x000001D8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT13_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP14</name>
          <description>USB Maximum Transmit Data Endpoint 14</description>
          <addressOffset>0x000001E0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP14_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL14</name>
          <description>USB Transmit Control and Status Endpoint 14 Low</description>
          <addressOffset>0x000001E2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL14_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL14_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL14_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL14_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL14_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL14</name>
          <description>USB Transmit Control and Status Endpoint 14 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001E2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL14_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL14_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH14</name>
          <description>USB Transmit Control and Status Endpoint 14 High</description>
          <addressOffset>0x000001E3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH14_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH14_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH14_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH14_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH14_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH14_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP14</name>
          <description>USB Maximum Receive Data Endpoint 14</description>
          <addressOffset>0x000001E4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP14_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL14</name>
          <description>USB Receive Control and Status Endpoint 14 Low</description>
          <addressOffset>0x000001E6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL14_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL14_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH14</name>
          <description>USB Receive Control and Status Endpoint 14 High</description>
          <addressOffset>0x000001E7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH14_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH14_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH14_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH14_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH14</name>
          <description>USB Receive Control and Status Endpoint 14 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001E7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH14_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH14_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT14</name>
          <description>USB Receive Byte Count Endpoint 14</description>
          <addressOffset>0x000001E8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT14_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP15</name>
          <description>USB Maximum Transmit Data Endpoint 15</description>
          <addressOffset>0x000001F0</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP15_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL15</name>
          <description>USB Transmit Control and Status Endpoint 15 Low</description>
          <addressOffset>0x000001F2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL15_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL15_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL15_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL15_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL15_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL15</name>
          <description>USB Transmit Control and Status Endpoint 15 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001F2</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL15_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL15_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH15</name>
          <description>USB Transmit Control and Status Endpoint 15 High</description>
          <addressOffset>0x000001F3</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH15_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH15_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH15_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH15_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH15_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH15_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP15</name>
          <description>USB Maximum Receive Data Endpoint 15</description>
          <addressOffset>0x000001F4</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP15_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL15</name>
          <description>USB Receive Control and Status Endpoint 15 Low</description>
          <addressOffset>0x000001F6</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL15_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL15_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH15</name>
          <description>USB Receive Control and Status Endpoint 15 High</description>
          <addressOffset>0x000001F7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH15_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH15_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH15_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH15_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH15</name>
          <description>USB Receive Control and Status Endpoint 15 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x000001F7</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH15_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH15_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT15</name>
          <description>USB Receive Byte Count Endpoint 15</description>
          <addressOffset>0x000001F8</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT15_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXDPKTBUFDIS</name>
          <description>USB Receive Double Packet Buffer Disable</description>
          <addressOffset>0x00000340</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXDPKTBUFDIS_EP1</name>
              <description>EP1 RX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP2</name>
              <description>EP2 RX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP3</name>
              <description>EP3 RX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP4</name>
              <description>EP4 RX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP5</name>
              <description>EP5 RX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP6</name>
              <description>EP6 RX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP7</name>
              <description>EP7 RX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP8</name>
              <description>EP8 RX Double-Packet Buffer Disable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP9</name>
              <description>EP9 RX Double-Packet Buffer Disable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP10</name>
              <description>EP10 RX Double-Packet Buffer Disable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP11</name>
              <description>EP11 RX Double-Packet Buffer Disable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP12</name>
              <description>EP12 RX Double-Packet Buffer Disable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP13</name>
              <description>EP13 RX Double-Packet Buffer Disable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP14</name>
              <description>EP14 RX Double-Packet Buffer Disable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_RXDPKTBUFDIS_EP15</name>
              <description>EP15 RX Double-Packet Buffer Disable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXDPKTBUFDIS</name>
          <description>USB Transmit Double Packet Buffer Disable</description>
          <addressOffset>0x00000342</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXDPKTBUFDIS_EP1</name>
              <description>EP1 TX Double-Packet Buffer Disable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP2</name>
              <description>EP2 TX Double-Packet Buffer Disable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP3</name>
              <description>EP3 TX Double-Packet Buffer Disable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP4</name>
              <description>EP4 TX Double-Packet Buffer Disable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP5</name>
              <description>EP5 TX Double-Packet Buffer Disable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP6</name>
              <description>EP6 TX Double-Packet Buffer Disable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP7</name>
              <description>EP7 TX Double-Packet Buffer Disable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP8</name>
              <description>EP8 TX Double-Packet Buffer Disable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP9</name>
              <description>EP9 TX Double-Packet Buffer Disable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP10</name>
              <description>EP10 TX Double-Packet Buffer Disable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP11</name>
              <description>EP11 TX Double-Packet Buffer Disable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP12</name>
              <description>EP12 TX Double-Packet Buffer Disable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP13</name>
              <description>EP13 TX Double-Packet Buffer Disable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP14</name>
              <description>EP14 TX Double-Packet Buffer Disable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>USB_TXDPKTBUFDIS_EP15</name>
              <description>EP15 TX Double-Packet Buffer Disable</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DRRIS</name>
          <description>USB Device RESUME Raw Interrupt Status</description>
          <addressOffset>0x00000410</addressOffset>
          <fields>
            <field>
              <name>USB_DRRIS_RESUME</name>
              <description>RESUME Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
